{
  "esp8266.attach": "Verbinde mit dem WLAN Netzwerk.",
  "esp8266.detach": "Trenne Verbindung zum WLAN Netzwerk.",
  "esp8266.init": "Initialisiere das ESP8266 Modul und verbinde mit dem Seriellen Port.\nVersuche zuerst mit 9600 Baud (8N1) zu verbinden und setzt dann die Zielvorgaben. Resettet das Modul.",
  "esp8266.init|param|rate": "Die neue Baudrate, z.B. BaudRate.BaudRate115200",
  "esp8266.init|param|rx": "Der neue Empfangspin, z.B. SerialPin.C16",
  "esp8266.init|param|tx": "Der neue Sendepin, z.B. SerialPin.C17",
  "esp8266.isAttached": "Prüft, ob eine Verbindung zum WLAN Netzwerk besteht.",
  "esp8266.send": "Sende Nachricht via WLAN.",
  "esp8266.sendEncoded": "Sende eine kodierte Nachricht. Daten werden im Message Pack Format kodiert::\nINT[DeviceId]BYTES[Message]. Die max. Länge einer Nachricht ist 504 Byte.\nNachrichten werden ggf. mit einem 16 Byte Schlüssel verschlüsselt: [SECRET,ID,SECRET,ID].",
  "esp8266.sendEncoded|param|message": "Zu sendende Nachricht.",
  "esp8266.sendNumber": "Sendet eine Zahl zum Server. Die Nachricht wird als JSON formatiert gesendet.",
  "esp8266.sendOk": "Prüft, ob die letzte Sendeoperation erfolgreich war.\nSetzt den Status zurück.",
  "esp8266.sendString": "Sendet eine Zeichenkette zum Server. Die Nachricht wird als JSON formatiert gesendet.",
  "esp8266.setEncryption": "Setzt, ob Nachrichten mit AES verschlüsselt werden sollen. Siehe #showDeviceInfo\n, wie die Device ID und der Schlüssel angezeigt werden.\nAchtung: Funktioniert nur mit, wenn das Bluetooh Modul benutzt wird!",
  "esp8266.setEncryption|param|encrypted": "Ob die Daten verschlüsselt werden sollen, z.B. Falsch.",
  "esp8266.setServer": "Konfiguriert den Server, an den kodierte Nachrichten gesendet werden.",
  "esp8266.setServer|param|host": "Die Adresse des Servers, zu dem kodierte Nachrichten gesendet werden.",
  "esp8266.setServer|param|port": "Der Port des Servers, zu dem kodierte Nachrichten gesendet werden, z.B. 9090.",
  "esp8266.showDeviceInfo": "Zeigt die Geräte ID und den Schlüssel an."
}